{
    "characters": [
        {
            "name": "Aragorn",
            "race": "Men",
            "gender": "Male",
            "image": "https://static.wikia.nocookie.net/lotr/images/b/b6/Aragorn_profile.jpg/revision/latest?cb=20170121121423",
            "description": "Aragorn II, son of Arathorn II and Gilraen, also known as Elessar and Strider, was the 16th and last Chieftain of the Dúnedain of the North; later crowned King Elessar Telcontar (March 1, 2931 - FO 120), the 26th King of Arnor, 35th King of Gondor and first High King of Gondor and Arnor since the short reign of Isildur. He was a great Ranger and warrior, and as Isildur's heir he bore the shards of Narsil, reforged and renamed Andúril, Flame of the West, in the War of the Ring."
        },
        {
            "name": "Boromir",
            "race": "Men",
            "gender": "Male",
            "image": "https://static.wikia.nocookie.net/lotr/images/b/b4/Seanbean_boromir.jpg/revision/latest/scale-to-width-down/343?cb=20110327195115",
            "description": "Boromir was a valiant warrior of Gondor, renowned for his prowess in combat and skill on the battlefield. He was the eldest son of Denethor II, who was Steward of Gondor during the War of the Ring, and his wife Finduilas. Even the people of Rohan admired him, particularly Éomer. He was the older brother of Faramir"
        },
        {
            "name": "Isildur",
            "race": "Men",
            "gender": "Male",
            "image": "https://static.wikia.nocookie.net/lotr/images/6/6c/LOTR_Isildur.jpg/revision/latest/scale-to-width-down/350?cb=20130320004244",
            "description": "Isildur was the oldest son of Elendil and the brother of Anárion. He and Anárion founded and jointly ruled Gondor in the south, while their father dwelt in Arnor in the north. In the War of the Last Alliance, Isildur cut the One Ring from Sauron's hand, but he refused to destroy it. Isildur was later killed by Orcs and the ring was lost in the Disaster of the Gladden Fields for nearly 2,500 years. His refusal to destroy the ring; allowed Sauron's spirit to endure and ensured that; he would remain a threat to Middle-earth for years to come. Isildur's bloodline survived in the Dúnedain of the North and his heir would help end Sauron's power in the War of the Ring."
        },
        {
            "name": "Legolas",
            "race": "Elves",
            "gender": "Male",
            "image": "https://static.wikia.nocookie.net/lotr/images/3/33/Legolas_-_in_Two_Towers.PNG/revision/latest?cb=20120916035151",
            "description": "Legolas was a Sindar Elf who was part of the Fellowship of the Ring in the Third Age. Son of the Elvenking Thranduil of Mirkwood, Legolas was Mirkwood's prince, a messenger, and a master archer. With his keen eyesight, sensitive hearing, and excellent bowmanship, Legolas was valuable to the Fellowship in their journey across Middle-earth. He was well-known for becoming friends with the Dwarf Gimli, despite their long-held differences."
        },
        {
            "name": "Elrond",
            "race": "Elves",
            "gender": "Male",
            "image": "https://static.wikia.nocookie.net/lotr/images/9/9f/Elrond_of_Rivendell.jpg/revision/latest/scale-to-width-down/322?cb=20130202120854",
            "description": "Elrond (Sindarin: 'Star-dome') Half-elf, Lord of Rivendell, was a mighty Elf-ruler of old who dwelt in Middle-earth from the First Age to the beginning of the Fourth Age. He was the father of Elladan and Elrohir and Arwen Undómiel, the eventual wife of Aragorn II Elessar."
        },
        {
            "name": "Galadriel",
            "race": "Elves",
            "gender": "Female",
            "image": "https://static.wikia.nocookie.net/lotr/images/c/cb/Galadriel.jpg/revision/latest/scale-to-width-down/322?cb=20151015204512",
            "description": "Galadriel was the 'Lady' of the woods of Lothlórien, which she ruled with Celeborn, her husband. One of the greatest of the Elves in Middle-earth, she surpassed nearly all others in beauty, knowledge, and power. She bore Nenya, one of the three Elven rings of power. J.R.R. Tolkien deemed her as one of the mightiest and fairest of all Elves remaining in Middle-earth in the Third Age. She was the only daughter and youngest child of Finarfin, prince of the Ñoldor, and Eärwen, whose cousin was Lúthien. Her elder brothers were Finrod Felagund, Orodreth, Angrod, and Aegnor.[4] Galadriel was a niece of Fëanor, the most important Elf of the early First Age."
        },
        {
            "name": "Gandalf",
            "race": "Maiar",
            "gender": "Male",
            "image": "https://static.wikia.nocookie.net/lotr/images/e/e7/Gandalf_the_Grey.jpg/revision/latest/scale-to-width-down/350?cb=20121110131754",
            "description": "Gandalf the Grey, later known as Gandalf the White, and originally named Olórin (Quenya; IPA: [oˈloːrin]), was an Istar (Wizard), dispatched to Middle-earth in the Third Age to combat the threat of Sauron. He joined Thorin II Oakenshield and his company to reclaim the Lonely Mountain from Smaug, helped form the Fellowship of the Ring to destroy the One Ring, and led the Free Peoples in the final campaign of the War of the Ring."
        },
        {
            "name": "Saruman",
            "race": "Maiar",
            "gender": "Male",
            "image": "https://static.wikia.nocookie.net/lotr/images/0/0c/Christopher_Lee_as_Saruman.jpg/revision/latest/scale-to-width-down/343?cb=20170127113833",
            "description": "Saruman, also known as Saruman the White, was first of the Istari (Wizards), emissaries of the Valar who were sent to Middle-earth in the Third Age to help in countering the returned Sauron. He was the order's chief and the head of the White Council that opposed the Enemy. However, in time, the Wizard came to wish to share in the Dark Lord's power as the quasi-equal lieutenant by his side, or by claiming the One Ring first. He betrayed the White Council and his people and began serving Sauron. As Sauron's two-faced vassal, Saruman pledged Isengard's nominal fealty to Mordor and assailed the Kingdom of Rohan in the War of the Ring, in which he was defeated."
        },
        {
            "name": "Sauron",
            "race": "Maiar",
            "gender": "Male",
            "image": "https://static.wikia.nocookie.net/lotr/images/9/90/Sauron-2.jpg/revision/latest?cb=20110508182634",
            "description": "Sauron (Quenya; IPA [ˈsaʊron] or [ˈθaʊron]), the eponymous Lord of the Rings, was the greatest subversive Maia, the maker of the One Ring, renowned student of the Vala Aulë, and the most trusted lieutenant of Morgoth. After Morgoth's ousting by the Valar, Sauron became the second Dark Lord and sought to conquer Middle-earth through guileful trickery - chiefly in the Rings of Power - or overwhelming legions. At the end of the Second Age, Sauron caused the downfall of Númenor, and was then defeated in Mordor in the War of the Last Alliance of Elves and Men united under Gil-galad and Elendil. In the final battle, Isildur managed to cut the One Ring from him, dismantling his corporeal form and ridding much of his power. After centuries lying dormant, rebuilding strength and stirring awake evil things, Sauron returned to power late in the Third Age, but was vanquished at the destruction of his Ring in Mount Doom, by Frodo Baggins, and his spirit was claimed by the Void. To the Sindar of Beleriand, Sauron was known as Gorthaur in the First Age."
        },
        {
            "name": "Gimli",
            "race": "Dwarves",
            "gender": "Male",
            "image": "https://static.wikia.nocookie.net/lotr/images/e/ec/Gimli_-_FOTR.png/revision/latest/scale-to-width-down/350?cb=20121008105956",
            "description": "Gimli, son of Glóin, was a Dwarf of the House of Durin and a member of the Fellowship of the Ring. Unlike other Dwarves, he readily fought alongside Elves in the War of the Ring against Sauron at the end of the Third Age. After the defeat of Sauron, in the early Fourth Age, he was given the lordship over the Glittering Caves at Helm's Deep."
        },
        {
            "name": "Thorin",
            "race": "Dwarves",
            "gender": "Male",
            "image": "https://static.wikia.nocookie.net/lotr/images/5/56/Young_Thorin.png/revision/latest/scale-to-width-down/200?cb=20130315124513",
            "description": "Thorin II 'Oakenshield', eventually called King under the Mountain or Mountain King[1], was the son of Thráin II, the older brother of Frerin and Dís, the grandson of King Thrór and the uncle of Fíli and Kíli. Thorin was best known for his deeds as leader of a company that infiltrated the lost Kingdom under the Mountain to take it back from Smaug and for leading an alliance of Men, Dwarves, and Elves in the Battle of Five Armies."
        },
        {
            "name": "Glóin",
            "race": "Dwarves",
            "gender": "Male",
            "image": "https://static.wikia.nocookie.net/lotr/images/f/fc/Gloin_2.jpg/revision/latest/scale-to-width-down/350?cb=20120908171710",
            "description": "Glóin, son of Gróin was one of the Dwarves of Thorin II Oakenshield's company who set out to reclaim the Lonely Mountain in the Quest of Erebor. He was also the father of Gimli, who became a member of the Fellowship of the Ring. Glóin chiefly appears in The Hobbit as a supporting character. Glóin also appears in The Fellowship of the Ring during the Council of Elrond."
        },
        {
            "name": "Uglúk ",
            "race": "Uruk-hai",
            "gender": "Male",
            "image": "https://static.wikia.nocookie.net/lotr/images/6/68/Ugl%C3%BAk.jpg/revision/latest/scale-to-width-down/350?cb=20190210101956",
            "description": "Uglúk was the leader of the Uruk-hai who were sent from Isengard to pursue the Fellowship of the Ring in TA 3019. Uglúk and his company ambushed the Fellowship of the Ring at Amon Hen, succeeding in capturing two of the company's four hobbits, Meriadoc Brandybuck and Peregrin Took. In the skirmish, Uglúk killed Boromir with arrows. Under orders from his lord Saruman, Uglúk's company set out towards Isengard. Uglúk stood by Saruman's demands when a band of Orcs from Moria, led by Grishnákh of Mordor, tried to apprehend Merry and Pippin to take them to Mordor. Uglúk beheaded one of Grishnákh's followers to prevent Saruman's orders from being disobeyed. The hobbits were taken some way further, but near the borders of Fangorn Forest, an Éored of Rohirrim led by Éomer attacked and wiped out the Uruk-hai. Uglúk was slain in single combat by Éomer himself during the fighting.[2"
        },
        {
            "name": "Mauhúr ",
            "race": "Uruk-hai",
            "gender": "Male",
            "image": "https://static.wikia.nocookie.net/lotr/images/0/04/Mauhur.jpg/revision/latest/scale-to-width-down/350?cb=20190205204613",
            "description": "Mauhúr was an Uruk-hai of Isengard in the late Third Age, during the War of the Ring. Mauhúr was sent to reinforce Uglúk and the Uruk-hai Scouts as they returned to Isengard with Merry and Pippin. He found them surrounded by Éomer's Rohirrim éored at the edge of Fangorn Forest, from which he led his Uruk-hai in an attack. The Rohirrim were able to defeat the Orcs, however, despite Mauhúr's reinforcements. It is assumed Mauhúr was among those killed by them."
        },
        {
            "name": "Azog  ",
            "race": "Orcs",
            "gender": "Male",
            "image": "https://static.wikia.nocookie.net/lotr/images/3/3c/640px-Azog.jpg/revision/latest/scale-to-width-down/350?cb=20170102193033",
            "description": "Azog was an Orc-lord of the Third Age who commanded the tribes of Moria until his death in TA 2799. He was responsible for the death of the Dwarven King Thrór."
        }
    ]
}